<template>
  <div class="school-program">
    <h2 class="school-program__title">
      Программа
    </h2>
    <elements-collapse v-for="item in tabs" class="school-program__required-collapse" :title="item.title">
      <ul class="school-program__required-list">
        <li v-for="element in item?.items">{{ element }}</li>
      </ul>
    </elements-collapse>
  </div>
</template>

<script>
const tabs = [
  {
    title: 'Блок 1. 1 триместр (1-12 неделя)',
    items: [
      '— Урок гинеколога. Особенности 1 триместра + pdf-файл с конспектом',
      '— Урок врача аюрведы. Аюрведа в 1 триместре беременности + pdf-файл с конспектом',
      '— Урок психолога. Период беременности, послеродовый период и грудное вскармливание + pdf-файл с конспектом',
      '— Урок маммолога. Молочная железа и беременность + pdf-файл с конспектом',
      '— Урок остеопата. Мягкие техники и остеопатия в 1 и 2 триместре беременности',
      '— Урок йоги. Йога в период беременности',
      '— Урок гинеколога и стилиста. Что носить беременным?'
    ]
  },
  {
    title: 'Блок 2. 2 триместр (13-24 неделя)',
    items: [
      '— Урок гинеколога. Особенности 1 триместра + pdf-файл с конспектом',
      '— Урок врача аюрведы. Аюрведа в 1 триместре беременности + pdf-файл с конспектом',
      '— Урок психолога. Период беременности, послеродовый период и грудное вскармливание + pdf-файл с конспектом',
      '— Урок маммолога. Молочная железа и беременность + pdf-файл с конспектом',
      '— Урок остеопата. Мягкие техники и остеопатия в 1 и 2 триместре беременности',
      '— Урок йоги. Йога в период беременности',
      '— Урок гинеколога и стилиста. Что носить беременным?'
    ]
  },
  {
    title: 'Блок 3. 3 триместр (24-40 неделя)',
    items: [
      '— Урок гинеколога. Особенности 1 триместра + pdf-файл с конспектом',
      '— Урок врача аюрведы. Аюрведа в 1 триместре беременности + pdf-файл с конспектом',
      '— Урок психолога. Период беременности, послеродовый период и грудное вскармливание + pdf-файл с конспектом',
      '— Урок маммолога. Молочная железа и беременность + pdf-файл с конспектом',
      '— Урок остеопата. Мягкие техники и остеопатия в 1 и 2 триместре беременности',
      '— Урок йоги. Йога в период беременности',
      '— Урок гинеколога и стилиста. Что носить беременным?'
    ]
  },
  {
    title: 'Блок 4. Подготовка к родам',
    items: [
      '— Урок гинеколога. Особенности 1 триместра + pdf-файл с конспектом',
      '— Урок врача аюрведы. Аюрведа в 1 триместре беременности + pdf-файл с конспектом',
      '— Урок психолога. Период беременности, послеродовый период и грудное вскармливание + pdf-файл с конспектом',
      '— Урок маммолога. Молочная железа и беременность + pdf-файл с конспектом',
      '— Урок остеопата. Мягкие техники и остеопатия в 1 и 2 триместре беременности',
      '— Урок йоги. Йога в период беременности',
      '— Урок гинеколога и стилиста. Что носить беременным?'
    ]
  },
  {
    title: 'Блок 5. Послеродовый период',
    items: [
      '— Урок гинеколога. Особенности 1 триместра + pdf-файл с конспектом',
      '— Урок врача аюрведы. Аюрведа в 1 триместре беременности + pdf-файл с конспектом',
      '— Урок психолога. Период беременности, послеродовый период и грудное вскармливание + pdf-файл с конспектом',
      '— Урок маммолога. Молочная железа и беременность + pdf-файл с конспектом',
      '— Урок остеопата. Мягкие техники и остеопатия в 1 и 2 триместре беременности',
      '— Урок йоги. Йога в период беременности',
      '— Урок гинеколога и стилиста. Что носить беременным?'
    ]
  },
  {
    title: 'Блок 6. Бонусы',
    items: [
      '— Урок гинеколога. Особенности 1 триместра + pdf-файл с конспектом',
      '— Урок врача аюрведы. Аюрведа в 1 триместре беременности + pdf-файл с конспектом',
      '— Урок психолога. Период беременности, послеродовый период и грудное вскармливание + pdf-файл с конспектом',
      '— Урок маммолога. Молочная железа и беременность + pdf-файл с конспектом',
      '— Урок остеопата. Мягкие техники и остеопатия в 1 и 2 триместре беременности',
      '— Урок йоги. Йога в период беременности',
      '— Урок гинеколога и стилиста. Что носить беременным?'
    ]
  }
]

  export default {

    setup () {

      return {
        tabs
      }
    }
  }
</script>

<style lang="scss" scoped>
  .school-program {
    width: 100%;

    &__title {
      font-size: 38px;
      color: #644C5C;
      margin: 0 0 40px 0;

      @media screen and (max-width: 1200px) {
        font-size: 36px;
      }

      @media screen and (max-width: 680px) {
        font-size: 30px;
      }
    }

    &__required-collapse {

      &:not(:last-child) {
        margin: 0 0 15px 0;
      }
    }

    &__required-list {
      list-style: none;
      padding: 0;
      margin: 0;
      color: #232323;
      font-size: 16px;
      max-width: 70%;

      @media screen and (max-width: 1200px) {
        max-width: 100%;
      }

      li {
        &:not(:last-child) {
          margin: 0 0 5px 0;
        }
      }
    }
  }
</style>
